Tekla Open API Reference for Tekla Structures 2025
RadiusDimension Constructor
Overload List
Name | Description
RadiusDimension(ViewBase, Point, Point, Point, Double)
 Creates a new radius dimension instance using three points and the distance.
RadiusDimension(ViewBase, Point, Point, Point, Double, RadiusDimensionAttributes)
 Creates a new radius dimension instance with the attributes, three points and the distance.
Top
See Also
Reference
RadiusDimension Class
Tekla.Structures.Drawing Namespace